In [2]:
import pandas as pd
df = pd.read_csv("balance.csv")
df.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

print the first 3 rows

In [3]:
df.head(3)

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81

display the last 4 rows

In [4]:
df.tail(4)

    Customer_ID Customer_Name Gender  Balance  Deposite
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

rename the column Customer_Name to become Name

In [9]:
df= df.rename({'Customer_Name':"Name"}, axis=1)

In [10]:
df.head()

   Customer_ID Name Gender  Balance  Deposite
0            1   Ah      F      500        80
1            2   Ab      F      340        82
2            3   Ah      F     3000        81
3            4   Ab      M      200       120
4            5   Ah      M      120       300

Remove Customer_ID

In [11]:
df = df.drop("Customer_ID", axis=1)

In [12]:
df.head()

  Name Gender  Balance  Deposite
0   Ah      F      500        80
1   Ab      F      340        82
2   Ah      F     3000        81
3   Ab      M      200       120
4   Ah      M      120       300

Create a new column that contains the total amount

In [14]:
df['Total']= df['Balance']+df['Deposite']

In [15]:
df.head()

  Name Gender  Balance  Deposite  Total
0   Ah      F      500        80    580
1   Ab      F      340        82    422
2   Ah      F     3000        81   3081
3   Ab      M      200       120    320
4   Ah      M      120       300    420

find the maximum deposit

In [16]:
mx = df['Deposite'].max()
mx

300

find the minmum balance

In [17]:
mn = df['Balance'].min()
mn

120

find the average of the total amounts

In [18]:
av = df['Total'].mean()
av

1689.657894736842

find the average of the amounts owned by female costumers

In [21]:
df1 = df[df['Gender']=='F']
av = df1['Total'].mean()
av

807.2083333333334